Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY0">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY1">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY2">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY3">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY4">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY5">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY6">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY7">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY8">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY9">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY10">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Early Interrupt for Corresponding Analog Input Ready bits" name="ADCEISTAT1__EIRDY11">
         <value caption="This bit is set when the early interrupt event occurs for the specified analog input. An interrupt will be generated if early interrupts are enabled in the ADCEIEN1 register. For the Class 1 analog inputs this bit will set as per the configuration of the ADCEIS bits in the ADCxTIME register. For the shared ADC module this bit will be set as per the configuration of the ADCEIS(2:0) bits in the ADCCON2 register." name="" value="0x1" />
         <value caption="Interrupts are disabled" name="" value="0x0" />
      </value-group>
