Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="Filter Object Register" name="CFD1FLTOBJ14" offset="0x980" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ14__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ14__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK14" offset="0x990" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK14__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK14__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ15" offset="0x9a0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ15__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ15__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK15" offset="0x9b0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK15__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK15__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ16" offset="0x9c0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ16__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ16__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK16" offset="0x9d0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK16__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK16__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ17" offset="0x9e0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ17__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ17__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK17" offset="0x9f0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK17__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK17__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ18" offset="0xa00" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ18__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ18__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK18" offset="0xa10" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK18__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK18__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ19" offset="0xa20" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ19__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ19__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK19" offset="0xa30" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK19__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK19__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ20" offset="0xa40" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ20__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ20__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK20" offset="0xa50" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK20__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK20__MIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1FLTOBJ21" offset="0xa60" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ21__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ21__EXIDE" />
         </register>
         <register caption="Filter Object Registe" name="CFD1MASK21" offset="0xa70" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK21__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK21__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ22" offset="0xa80" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ22__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ22__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK22" offset="0xa90" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK22__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK22__MIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1FLTOBJ23" offset="0xaa0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="SID" />
            <bitfield mask="0x1FFFF800" name="EID" />
            <bitfield caption="Standard Identifier Filter bit" mask="0x20000000" name="SID11" values="CFD1FLTOBJ23__SID11" />
            <bitfield caption="Extended Identifier Enable bit" mask="0x40000000" name="EXIDE" values="CFD1FLTOBJ23__EXIDE" />
         </register>
         <register caption="Filter Object Register" name="CFD1MASK23" offset="0xab0" rw="RW" size="4">
            <bitfield mask="0x000007FF" name="MSID" />
            <bitfield mask="0x1FFFF800" name="MEID" />
            <bitfield caption="Standard Identifier Mask bit" mask="0x20000000" name="MSID11" values="CFD1MASK23__MSID11" />
            <bitfield caption="Identifier Receive Mode bit" mask="0x40000000" name="MIDE" values="CFD1MASK23__MIDE" />
         </register>
