Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Overflow Interrupt Enable bit" name="CFD1FIFOCON11__RXOVIE">
         <value caption="Interrupt enabled for overflow event" name="" value="0x1" />
         <value caption="Interrupt disabled for overflow event" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit Attempts Exhausted Interrupt Enable bit" name="CFD1FIFOCON11__TXATIE">
         <value caption="Enable interrupt" name="" value="0x1" />
         <value caption="Disable interrupt" name="" value="0x0" />
      </value-group>
      <value-group caption="Received Message Time Stamp Enable bit" name="CFD1FIFOCON11__RXTSEN">
         <value caption="Capture time stamp in received message object in RAM." name="" value="0x1" />
         <value caption="Dont capture time stamp." name="" value="0x0" />
      </value-group>
      <value-group caption="Auto RTR Enable bit" name="CFD1FIFOCON11__RTREN">
         <value caption="When a remote transmit is received" name="" value="0x1" />
         <value caption="When a remote transmit is received" name="" value="0x0" />
      </value-group>
      <value-group caption="TX / RX Buffer Selection bit" name="CFD1FIFOCON11__TXEN">
         <value caption="Transmit Message Object" name="" value="0x1" />
         <value caption="Receive Message Object" name="" value="0x0" />
      </value-group>
      <value-group caption="Increment Head / Tail bit" name="CFD1FIFOCON11__UINC">
         <value caption="(TXEN is 1) The FIFO head will increment by a single message / (TXEN is 0) The FIFO tail will increment by a single message" name="" value="0x1" />
         <value caption="(TXEN is 1) The FIFO head will not increment by a single message / (TXEN is 0) The FIFO tail will not increment by a single message" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Send Request bit" name="CFD1FIFOCON11__TXREQ">
         <value caption="(TXEN is 1) Requests sending a message; the bit will automatically clear when all the messages queued in the FIFO are successfully sent / (TXEN is 0) This bit has no effect." name="" value="0x1" />
         <value caption="(TXEN is 1) Clearing the bit to 0 while set will request a message abort. / (TXEN is 0) This bit has no effect." name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Reset bit" name="CFD1FIFOCON11__FRESET">
         <value caption="FIFO will be reset when bit is set; cleared by hardware when FIFO is reset. User should poll whether this bit is clear before taking any action" name="" value="0x1" />
         <value caption="No effect" name="" value="0x0" />
      </value-group>
      <value-group caption="Message Transmit Priority bits (EXPANDED)" name="CFD1FIFOCON11__TXPRI">
         <value caption="Highest Message Priority" name="" value="0x1f" />
         <value caption="Message priority 30" name="" value="0x1e" />
         <value caption="Message priority 29" name="" value="0x1d" />
         <value caption="Message priority 28" name="" value="0x1c" />
         <value caption="Message priority 27" name="" value="0x1b" />
         <value caption="Message priority 26" name="" value="0x1a" />
         <value caption="Message priority 25" name="" value="0x19" />
         <value caption="Message priority 24" name="" value="0x18" />
         <value caption="Message priority 23" name="" value="0x17" />
         <value caption="Message priority 22" name="" value="0x16" />
         <value caption="Message priority 21" name="" value="0x15" />
         <value caption="Message priority 20" name="" value="0x14" />
         <value caption="Message priority 19" name="" value="0x13" />
         <value caption="Message priority 18" name="" value="0x12" />
         <value caption="Message priority 17" name="" value="0x11" />
         <value caption="Message priority 16" name="" value="0x10" />
         <value caption="Message priority 15" name="" value="0xf" />
         <value caption="Message priority 14" name="" value="0xe" />
         <value caption="Message priority 13" name="" value="0xd" />
         <value caption="Message priority 12" name="" value="0xc" />
         <value caption="Message priority 11" name="" value="0xb" />
         <value caption="Message priority 10" name="" value="0xa" />
         <value caption="Message priority 9" name="" value="0x9" />
         <value caption="Message priority 8" name="" value="0x8" />
         <value caption="Message priority 7" name="" value="0x7" />
         <value caption="Message priority 6" name="" value="0x6" />
         <value caption="Message priority 5" name="" value="0x5" />
         <value caption="Message priority 4" name="" value="0x4" />
         <value caption="Message priority 3" name="" value="0x3" />
         <value caption="Message priority 2" name="" value="0x2" />
         <value caption="Message priority 1" name="" value="0x1" />
         <value caption="Lowest Message Priority" name="" value="0x0" />
      </value-group>
      <value-group caption="Retransmission Attempts bits" name="CFD1FIFOCON11__TXAT">
         <value caption="Unlimited number of retransmission attempts" name="" value="0x3" />
         <value caption="Unlimited number of retransmission attempts" name="" value="0x2" />
         <value caption="Three retransmission attempts" name="" value="0x1" />
         <value caption="Disable retransmission attempts" name="" value="0x0" />
      </value-group>
      <value-group caption="FIFO Size bits" name="CFD1FIFOCON11__FSIZE">
         <value caption="FIFO is 32 Messages deep" name="" value="0x1f" />
         <value caption="FIFO is 31 Messages deep" name="" value="0x1e" />
         <value caption="FIFO is 30 Messages deep" name="" value="0x1d" />
         <value caption="FIFO is 29 Messages deep" name="" value="0x1c" />
         <value caption="FIFO is 28 Messages deep" name="" value="0x1b" />
         <value caption="FIFO is 27 Messages deep" name="" value="0x1a" />
         <value caption="FIFO is 26 Messages deep" name="" value="0x19" />
         <value caption="FIFO is 25 Messages deep" name="" value="0x18" />
         <value caption="FIFO is 24 Messages deep" name="" value="0x17" />
         <value caption="FIFO is 23 Messages deep" name="" value="0x16" />
         <value caption="FIFO is 22 Messages deep" name="" value="0x15" />
         <value caption="FIFO is 21 Messages deep" name="" value="0x14" />
         <value caption="FIFO is 20 Messages deep" name="" value="0x13" />
         <value caption="FIFO is 19 Messages deep" name="" value="0x12" />
         <value caption="FIFO is 18 Messages deep" name="" value="0x11" />
         <value caption="FIFO is 17 Messages deep" name="" value="0x10" />
         <value caption="FIFO is 16 Messages deep" name="" value="0xf" />
         <value caption="FIFO is 15 Messages deep" name="" value="0xe" />
         <value caption="FIFO is 14 Messages deep" name="" value="0xd" />
         <value caption="FIFO is 13 Messages deep" name="" value="0xc" />
         <value caption="FIFO is 12 Messages deep" name="" value="0xb" />
         <value caption="FIFO is 11 Messages deep" name="" value="0xa" />
         <value caption="FIFO is 10 Messages deep" name="" value="0x9" />
         <value caption="FIFO is 9 Messages deep" name="" value="0x8" />
         <value caption="FIFO is 8 Messages deep" name="" value="0x7" />
         <value caption="FIFO is 7 Messages deep" name="" value="0x6" />
         <value caption="FIFO is 6 Messages deep" name="" value="0x5" />
         <value caption="FIFO is 5 Messages deep" name="" value="0x4" />
         <value caption="FIFO is 4 Messages deep" name="" value="0x3" />
         <value caption="FIFO is 3 Messages deep" name="" value="0x2" />
         <value caption="FIFO is 2 Messages deep" name="" value="0x1" />
         <value caption="FIFO is 1 Message deep" name="" value="0x0" />
      </value-group>
      <value-group caption="Payload Size bits" name="CFD1FIFOCON11__PLSIZE">
         <value caption="64 data bytes" name="" value="0x7" />
         <value caption="48 data bytes" name="" value="0x6" />
         <value caption="32 data bytes" name="" value="0x5" />
         <value caption="24 data bytes" name="" value="0x4" />
         <value caption="20 data bytes" name="" value="0x3" />
         <value caption="16 data bytes" name="" value="0x2" />
         <value caption="12 data bytes" name="" value="0x1" />
         <value caption="8 data bytes" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit/Receive FIFO Not Full/Not Empty Interrupt Enable bit" name="CFD1FIFOCON12__TFNRFNIE">
         <value caption="(TXEN is 1) Interrupt enabled for FIFO not full / (TXEN is 0) Interrupt enabled for FIFO not empty" name="" value="0x1" />
         <value caption="(TXEN is 1) Interrupt disabled for FIFO not full / (TXEN is 0) Interrupt disabled for FIFO not empty" name="" value="0x0" />
      </value-group>
      <value-group caption="Transmit/Receive FIFO Half Empty/Half Full Interrupt Enable bit" name="CFD1FIFOCON12__TFHRFHIE">
         <value caption="(TXEN is 1) Interrupt enabled for FIFO half empty / (TXEN is 0) Interrupt enabled for FIFO half full" name="" value="0x1" />
         <value caption="(TXEN is 1) Interrupt disabled for FIFO half empty / (TXEN is 0) Interrupt disabled for FIFO half full" name="" value="0x0" />
      </value-group>
