Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC3SEL__DS3">
         <value caption="Unused" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA Channel 0 interrupt" name="" value="0x5" />
         <value caption="ADC end of conversion" name="" value="0x4" />
         <value caption="UART1 TX out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC3SEL__DS4">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="SCCP5 OCM5 output" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 1 Signal Selection bits" name="CLC4SEL__DS1">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="SCCP5 OCM5 output" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 2 Signal Selection bits" name="CLC4SEL__DS2">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="SCCP4 OCMP compare match event" name="" value="0x6" />
         <value caption="SCCP4 OCM4 output" name="" value="0x5" />
         <value caption="UART1 RX in" name="" value="0x4" />
         <value caption="SPI1 SDO1 out" name="" value="0x3" />
         <value caption="CMP2 out" name="" value="0x2" />
         <value caption="CLC1 out" name="" value="0x1" />
         <value caption="CLCINA I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 3 Signal Selection bits" name="CLC4SEL__DS3">
         <value caption="Unused" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="DMA Channel 0 interrupt" name="" value="0x5" />
         <value caption="ADC end of conversion" name="" value="0x4" />
         <value caption="UART1 TX out" name="" value="0x3" />
         <value caption="CMP1 out" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Data Selection MUX 4 Signal Selection bits" name="CLC4SEL__DS4">
         <value caption="SCCP5 OCMP compare match event" name="" value="0x7" />
         <value caption="MCCP1 OCMP compare match event" name="" value="0x6" />
         <value caption="RTCC event" name="" value="0x5" />
         <value caption="CMP3 out" name="" value="0x4" />
         <value caption="SPI1 SDI1 in" name="" value="0x3" />
         <value caption="SCCP5 OCM5 output" name="" value="0x2" />
         <value caption="CLC2 out" name="" value="0x1" />
         <value caption="CLCINB I/O pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 Negated Enable bit" name="CLC1GLS__G1D1N">
         <value caption="The Data Source 1 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 1 True Enable bit" name="CLC1GLS__G1D1T">
         <value caption="The Data Source 1 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 1 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 Negated Enable bit" name="CLC1GLS__G1D2N">
         <value caption="The Data Source 2 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 2 True Enable bit" name="CLC1GLS__G1D2T">
         <value caption="The Data Source 2 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 2 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 Negated Enable bit" name="CLC1GLS__G1D3N">
         <value caption="The Data Source 3 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 3 True Enable bit" name="CLC1GLS__G1D3T">
         <value caption="The Data Source 3 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 3 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 Negated Enable bit" name="CLC1GLS__G1D4N">
         <value caption="The Data Source 4 inverted signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 inverted signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
      <value-group caption="Gate 1 Data Source 4 True Enable bit" name="CLC1GLS__G1D4T">
         <value caption="The Data Source 4 signal is enabled for Gate 1" name="" value="0x1" />
         <value caption="The Data Source 4 signal is disabled for Gate 1" name="" value="0x0" />
      </value-group>
