Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH6CON__CHAED">
         <value caption="Channel start/abort events will be registered" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH6CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH6CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Length bit" name="DCH6CON__CHPATLEN">
         <value caption="2 byte length" name="" value="0x1" />
         <value caption="1 byte length" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Pattern Ignore Byte bit" name="DCH6CON__CHPIGNEN">
         <value caption="Treat any byte that matches the CHPIGN bits as a dont care when pattern matching is enabled" name="" value="0x1" />
         <value caption="Disable this feature" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH6CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Priority bits" name="DCH7CON__CHPRI">
         <value caption="Channel has priority 3 (highest)" name="CHPRI3" value="0x3" />
         <value caption="Channel has priority 2" name="CHPRI2" value="0x2" />
         <value caption="Channel has priority 1" name="CHPRI1" value="0x1" />
         <value caption="Channel has priority 0" name="CHPRI0" value="0x0" />
      </value-group>
      <value-group caption="Channel Event Detected bit" name="DCH7CON__CHEDET">
         <value caption="An event has been detected" name="" value="0x1" />
         <value caption="No events have been detected" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Automatic Enable bit" name="DCH7CON__CHAEN">
         <value caption="Channel is continuously enabled" name="" value="0x1" />
         <value caption="Channel is disabled on block transfer complete" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Chain Enable bit" name="DCH7CON__CHCHN">
         <value caption="Allow channel to be chained" name="" value="0x1" />
         <value caption="Do not allow channel to be chained" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Allow Events If Disabled bit" name="DCH7CON__CHAED">
         <value caption="Channel start/abort events will be registered" name="" value="0x1" />
         <value caption="Channel start/abort events will be ignored if the channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Enable bit" name="DCH7CON__CHEN">
         <value caption="Channel is enabled" name="" value="0x1" />
         <value caption="Channel is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Chain Channel Selection bit" name="DCH7CON__CHCHNS">
         <value caption="Chain to channel lower in natural priority (CH1 will be enabled by CH2 transfer complete)" name="" value="0x1" />
         <value caption="Chain to channel higher in natural priority (CH1 will be enabled by CH0 transfer complete)" name="" value="0x0" />
      </value-group>
      <value-group caption="Pattern Length bit" name="DCH7CON__CHPATLEN">
         <value caption="2 byte length" name="" value="0x1" />
         <value caption="1 byte length" name="" value="0x0" />
      </value-group>
      <value-group caption="Enable Pattern Ignore Byte bit" name="DCH7CON__CHPIGNEN">
         <value caption="Treat any byte that matches the CHPIGN bits as a dont care when pattern matching is enabled" name="" value="0x1" />
         <value caption="Disable this feature" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Busy bit" name="DCH7CON__CHBUSY">
         <value caption="Channel is active or has been enabled" name="" value="0x1" />
         <value caption="Channel is inactive or has been disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH0ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Start IRQ Enable bit" name="DCH0ECON__SIRQEN">
         <value caption="Start channel cell transfer if an interrupt matching CHSIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHSIRQ is ignored and does not start a transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Pattern Match Abort Enable bit" name="DCH0ECON__PATEN">
         <value caption="Abort transfer and clear CHEN on pattern match" name="" value="0x1" />
         <value caption="Pattern match is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Abort Transfer bit" name="DCH0ECON__CABORT">
         <value caption="A DMA transfer is aborted when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="DMA Forced Transfer bit" name="DCH0ECON__CFORCE">
         <value caption="A DMA transfer is forced to begin when this bit is written to a 1" name="" value="0x1" />
         <value caption="This bit always reads 0" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Transfer Start IRQ bits" name="DCH0ECON__CHSIRQ">
         <value caption="Interrupt 255 will initiate a DMA transfer" name="" value="0xff" />
         <value caption="Interrupt 1 will initiate a DMA transfer" name="" value="0x1" />
         <value caption="Interrupt 0 will initiate a DMA transfer" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Transfer Abort IRQ bits" name="DCH0ECON__CHAIRQ">
         <value caption="Interrupt 255 will abort any transfers in progress and set CHAIF flag" name="" value="0xff" />
         <value caption="Interrupt 1 will abort any transfers in progress and set CHAIF flag" name="" value="0x1" />
         <value caption="Interrupt 0 will abort any transfers in progress and set CHAIF flag" name="" value="0x0" />
      </value-group>
      <value-group caption="Channel Abort IRQ Enable bit" name="DCH1ECON__AIRQEN">
         <value caption="Channel transfer is aborted if an interrupt matching CHAIRQ occurs" name="" value="0x1" />
         <value caption="Interrupt number CHAIRQ is ignored and does not terminate a transfer" name="" value="0x0" />
      </value-group>
