Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="" name="IPC5" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000003" name="IC4EIS" />
            <bitfield mask="0x0000001C" name="IC4EIP" />
            <bitfield mask="0x00000300" name="IC4IS" />
            <bitfield mask="0x00001C00" name="IC4IP" />
            <bitfield mask="0x00030000" name="OC4IS" />
            <bitfield mask="0x001C0000" name="OC4IP" />
            <bitfield mask="0x03000000" name="INT4IS" />
            <bitfield mask="0x1C000000" name="INT4IP" />
         </register>
         <register caption="" name="IPC6" offset="0x1A0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T5IS" />
            <bitfield mask="0x0000001C" name="T5IP" />
            <bitfield mask="0x00000300" name="IC5EIS" />
            <bitfield mask="0x00001C00" name="IC5EIP" />
            <bitfield mask="0x00030000" name="IC5IS" />
            <bitfield mask="0x001C0000" name="IC5IP" />
            <bitfield mask="0x03000000" name="OC5IS" />
            <bitfield mask="0x1C000000" name="OC5IP" />
         </register>
         <register caption="" name="IPC7" offset="0x1B0" rw="RW" size="4">
            <bitfield mask="0x00030000" name="RTCCIS" />
            <bitfield mask="0x001C0000" name="RTCCIP" />
            <bitfield mask="0x03000000" name="FCEIS" />
            <bitfield mask="0x1C000000" name="FCEIP" />
         </register>
         <register caption="" name="IPC8" offset="0x1C0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CMP1IS" />
            <bitfield mask="0x0000001C" name="CMP1IP" />
            <bitfield mask="0x00000300" name="CMP2IS" />
            <bitfield mask="0x00001C00" name="CMP2IP" />
            <bitfield mask="0x03000000" name="SPI1EIS" />
            <bitfield mask="0x1C000000" name="SPI1EIP" />
         </register>
         <register caption="" name="IPC9" offset="0x1D0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="SPI1RXIS" />
            <bitfield mask="0x0000001C" name="SPI1RXIP" />
            <bitfield mask="0x00000300" name="SPI1TXIS" />
            <bitfield mask="0x00001C00" name="SPI1TXIP" />
            <bitfield mask="0x00030000" name="U1EIS" />
            <bitfield mask="0x001C0000" name="U1EIP" />
            <bitfield mask="0x03000000" name="U1RXIS" />
            <bitfield mask="0x1C000000" name="U1RXIP" />
         </register>
         <register caption="" name="IPC10" offset="0x1E0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U1TXIS" />
            <bitfield mask="0x0000001C" name="U1TXIP" />
            <bitfield mask="0x00000300" name="I2C1BIS" />
            <bitfield mask="0x00001C00" name="I2C1BIP" />
            <bitfield mask="0x00030000" name="I2C1SIS" />
            <bitfield mask="0x001C0000" name="I2C1SIP" />
            <bitfield mask="0x03000000" name="I2C1MIS" />
            <bitfield mask="0x1C000000" name="I2C1MIP" />
         </register>
         <register caption="" name="IPC11" offset="0x1F0" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNAIS" />
            <bitfield mask="0x0000001C" name="CNAIP" />
            <bitfield mask="0x00000300" name="CNBIS" />
            <bitfield mask="0x00001C00" name="CNBIP" />
            <bitfield mask="0x00030000" name="CNCIS" />
            <bitfield mask="0x001C0000" name="CNCIP" />
            <bitfield mask="0x03000000" name="CNDIS" />
            <bitfield mask="0x1C000000" name="CNDIP" />
         </register>
         <register caption="" name="IPC12" offset="0x200" rw="RW" size="4">
            <bitfield mask="0x00000003" name="CNEIS" />
            <bitfield mask="0x0000001C" name="CNEIP" />
            <bitfield mask="0x00000300" name="CNFIS" />
            <bitfield mask="0x00001C00" name="CNFIP" />
            <bitfield mask="0x00030000" name="CNGIS" />
            <bitfield mask="0x001C0000" name="CNGIP" />
         </register>
         <register caption="" name="IPC13" offset="0x210" rw="RW" size="4">
            <bitfield mask="0x00000300" name="SPI2EIS" />
            <bitfield mask="0x00001C00" name="SPI2EIP" />
            <bitfield mask="0x00030000" name="SPI2RXIS" />
            <bitfield mask="0x001C0000" name="SPI2RXIP" />
            <bitfield mask="0x03000000" name="SPI2TXIS" />
            <bitfield mask="0x1C000000" name="SPI2TXIP" />
         </register>
         <register caption="" name="IPC14" offset="0x220" rw="RW" size="4">
            <bitfield mask="0x00000003" name="U2EIS" />
            <bitfield mask="0x0000001C" name="U2EIP" />
            <bitfield mask="0x00000300" name="U2RXIS" />
            <bitfield mask="0x00001C00" name="U2RXIP" />
            <bitfield mask="0x00030000" name="U2TXIS" />
            <bitfield mask="0x001C0000" name="U2TXIP" />
            <bitfield mask="0x03000000" name="I2C2BIS" />
            <bitfield mask="0x1C000000" name="I2C2BIP" />
         </register>
         <register caption="" name="IPC15" offset="0x230" rw="RW" size="4">
            <bitfield mask="0x00000003" name="I2C2SIS" />
            <bitfield mask="0x0000001C" name="I2C2SIP" />
            <bitfield mask="0x00000300" name="I2C2MIS" />
            <bitfield mask="0x00001C00" name="I2C2MIP" />
         </register>
         <register caption="" name="IPC17" offset="0x250" rw="RW" size="4">
            <bitfield mask="0x03000000" name="CTMUIS" />
            <bitfield mask="0x1C000000" name="CTMUIP" />
         </register>
         <register caption="" name="IPC18" offset="0x260" rw="RW" size="4">
            <bitfield mask="0x00000003" name="DMA0IS" />
            <bitfield mask="0x0000001C" name="DMA0IP" />
            <bitfield mask="0x00000300" name="DMA1IS" />
            <bitfield mask="0x00001C00" name="DMA1IP" />
            <bitfield mask="0x00030000" name="DMA2IS" />
            <bitfield mask="0x001C0000" name="DMA2IP" />
            <bitfield mask="0x03000000" name="DMA3IS" />
            <bitfield mask="0x1C000000" name="DMA3IP" />
         </register>
         <register caption="" name="IPC19" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T6IS" />
            <bitfield mask="0x0000001C" name="T6IP" />
            <bitfield mask="0x00000300" name="IC6EIS" />
            <bitfield mask="0x00001C00" name="IC6EIP" />
            <bitfield mask="0x00030000" name="IC6IS" />
            <bitfield mask="0x001C0000" name="IC6IP" />
            <bitfield mask="0x03000000" name="OC6IS" />
            <bitfield mask="0x1C000000" name="OC6IP" />
         </register>
         <register caption="" name="IPC20" offset="0x280" rw="RW" size="4">
            <bitfield mask="0x00000003" name="T7IS" />
            <bitfield mask="0x0000001C" name="T7IP" />
            <bitfield mask="0x00000300" name="IC7EIS" />
            <bitfield mask="0x00001C00" name="IC7EIP" />
            <bitfield mask="0x00030000" name="IC7IS" />
            <bitfield mask="0x001C0000" name="IC7IP" />
            <bitfield mask="0x03000000" name="OC7IS" />
            <bitfield mask="0x1C000000" name="OC7IP" />
         </register>
