Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="" name="OFF101" offset="0x6D4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF102" offset="0x6D8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF103" offset="0x6DC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF104" offset="0x6E0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF105" offset="0x6E4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF106" offset="0x6E8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF107" offset="0x6EC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF108" offset="0x5c4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF109" offset="0x6F4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF110" offset="0x6F8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF111" offset="0x6FC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF112" offset="0x700" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF113" offset="0x704" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF114" offset="0x708" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF115" offset="0x70C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF116" offset="0x710" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF117" offset="0x714" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF118" offset="0x718" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF119" offset="0x71C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF120" offset="0x720" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF121" offset="0x724" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF122" offset="0x728" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF123" offset="0x72C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF124" offset="0x730" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF125" offset="0x734" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF130" offset="0x748" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF131" offset="0x74C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF132" offset="0x750" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF133" offset="0x754" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF146" offset="0x788" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF147" offset="0x78C" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF152" offset="0x7A0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF153" offset="0x7A4" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF154" offset="0x7A8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF155" offset="0x7AC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF156" offset="0x7B0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF157" offset="0x638" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF158" offset="0x7B8" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF159" offset="0x7BC" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
         <register caption="" name="OFF160" offset="0x7C0" rw="RW" size="4">
            <bitfield mask="0x0003FFFE" name="VOFF" />
         </register>
