Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG4" offset="0x460" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG5" offset="0x560" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="Secondary PWM Trigger Compare Register x (x = 1 through 12)" name="STRIG6" offset="0x660" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="STRGCMP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP1" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP2" offset="0x270" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP3" offset="0x370" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP4" offset="0x470" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP5" offset="0x570" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="PWM Timer Capture Register x (x = 1 through 12)" name="CAP6" offset="0x670" rw="RW" size="4">
            <bitfield mask="0x0000FFFF" name="CAP" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON1" offset="0x180" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON1__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON1__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON1__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON1__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON1__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON1__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON2" offset="0x280" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON2__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON2__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON2__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON2__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON2__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON2__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON3" offset="0x380" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON3__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON3__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON3__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON3__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON3__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON3__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON4" offset="0x480" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON4__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON4__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON4__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON4__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON4__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON4__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON5" offset="0x580" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON5__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON5__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON5__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON5__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON5__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON5__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Control Register x (x = 1 through 12)" name="LEBCON6" offset="0x680" rw="RW" size="4">
            <bitfield caption="Current-Limit Leading-Edge Blanking Enable bit" mask="0x00000400" name="CLLEBEN" values="LEBCON6__CLLEBEN" />
            <bitfield caption="Fault Input Leading-Edge Blanking Enable bit" mask="0x00000800" name="FLTLEBEN" values="LEBCON6__FLTLEBEN" />
            <bitfield caption="PWMxL Falling Edge Trigger Enable bit" mask="0x00001000" name="PLF" values="LEBCON6__PLF" />
            <bitfield caption="PWMxL Rising Edge Trigger Enable bit" mask="0x00002000" name="PLR" values="LEBCON6__PLR" />
            <bitfield caption="PWMxH Falling Edge Trigger Enable bit" mask="0x00004000" name="PHF" values="LEBCON6__PHF" />
            <bitfield caption="PWMxH Rising Edge Trigger Enable bit" mask="0x00008000" name="PHR" values="LEBCON6__PHR" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY1" offset="0x190" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY2" offset="0x290" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
         <register caption="Leading-Edge Blanking Delay Register x (x = 1 through 12)" name="LEBDLY3" offset="0x390" rw="RW" size="4">
            <bitfield mask="0x00000FFF" name="LEB" />
         </register>
