Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Current-Limit Interrupt Enable bit" name="PWMCON6__CLIEN">
         <value caption="Current-limit interrupt is enabled. If CLIF is 1 an interrupt event will be generated" name="" value="0x1" />
         <value caption="Current-limit interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Enable bit" name="PWMCON6__FLTIEN">
         <value caption="Fault interrupt is enabled. If FLTIF is 1 an interrupt event will be generated" name="" value="0x1" />
         <value caption="Fault interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMH Interrupt Status bit" name="PWMCON6__PWMHIF">
         <value caption="PWM period match interrupt has occurred" name="" value="0x1" />
         <value caption="PWM period match interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="PWML Interrupt Status bit" name="PWMCON6__PWMLIF">
         <value caption="PWM Timer equal to 0x4 interrupt has occurred" name="" value="0x1" />
         <value caption="PWM Interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Trigger Interrupt Status bit" name="PWMCON6__TRGIF">
         <value caption="Trigger interrupt is pending" name="" value="0x1" />
         <value caption="Trigger interrupt is not pending" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Status bit" name="PWMCON6__CLIF">
         <value caption="Current limit has occurred" name="" value="0x1" />
         <value caption="Current limit has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Interrupt Flag bit" name="PWMCON6__FLTIF">
         <value caption="Fault interrupt has occurred" name="" value="0x1" />
         <value caption="Fault interrupt has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Output Override Synchronization bit" name="IOCON1__OSYNC">
         <value caption="Output overrides through the OVRDAT bits are synchronized to the PWM time base" name="" value="0x1" />
         <value caption="Output overrides through the OVRDAT bits occur on next CPU clock boundary" name="" value="0x0" />
      </value-group>
      <value-group caption="SWAP PWMxH and PWMxL Pins bit" name="IOCON1__SWAP">
         <value caption="PWMxH output signal is connected to PWMxL pin; PWMxL output signal is connected to PWMxH pin" name="" value="0x1" />
         <value caption="PWMxH and PWMxL output signals pins are mapped to their respective pins" name="" value="0x0" />
      </value-group>
      <value-group caption="Override Enable for PWMxL Pin bit" name="IOCON1__OVRENL">
         <value caption="OVRDAT provides data for output on PWMxL pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Override Enable for PWMxH Pin bit" name="IOCON1__OVRENH">
         <value caption="OVRDAT provides data for output on PWMxH pin" name="" value="0x1" />
         <value caption="PWM generator provides data for PWMxH pin" name="" value="0x0" />
      </value-group>
      <value-group caption="PWM x I/O Pin Mode bits" name="IOCON1__PMOD">
         <value caption="PWMxL output is held at logic 0 (adjusted by the POLL bit)" name="" value="0x3" />
         <value caption="PWM I/O pin pair is in Push-Pull Output mode" name="" value="0x2" />
         <value caption="PWM I/O pin pair is in Redundant Output mode" name="" value="0x1" />
         <value caption="PWM I/O pin pair is in Complementary Output mode" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Pin Polarity bit" name="IOCON1__POLL">
         <value caption="PWMxL pin is active-low" name="" value="0x1" />
         <value caption="PWMxL pin is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Pin Polarity bit" name="IOCON1__POLH">
         <value caption="PWMxH pin is active-low" name="" value="0x1" />
         <value caption="PWMxH pin is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxL Output Pin Ownership bit" name="IOCON1__PENL">
         <value caption="PWM module controls PWMxL pin" name="" value="0x1" />
         <value caption="GPIO module controls PWMxL pin" name="" value="0x0" />
      </value-group>
      <value-group caption="PWMxH Output Pin Ownership bit" name="IOCON1__PENH">
         <value caption="PWM module controls PWMxH pin" name="" value="0x1" />
         <value caption="GPIO module controls PWMxH pin" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Mode bits for PWM Generator x" name="IOCON1__FLTMOD">
         <value caption="Fault input is disabled" name="" value="0x3" />
         <value caption="Selected fault source forces PWMxH, PWMxL pins to FLTDAT values (cycle by cycle)" name="" value="0x1" />
         <value caption="Selected fault source forces PWMxH, PWMxL pins to FLTDAT values (Latched condition)" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Polarity bits for PWM Generator x" name="IOCON1__FLTPOL">
         <value caption="The selected fault source is active-low" name="" value="0x1" />
         <value caption="The selected fault source is active-high" name="" value="0x0" />
      </value-group>
      <value-group caption="Fault Control Signal Source Select bits for PWM Generator x" name="IOCON1__FLTSRC">
         <value caption="FLT15" name="" value="0xf" />
         <value caption="Comparator 5" name="" value="0xc" />
         <value caption="Comparator 4" name="" value="0xb" />
         <value caption="Comparator 3" name="" value="0xa" />
         <value caption="Comparator 2" name="" value="0x9" />
         <value caption="Comparator 1" name="" value="0x8" />
         <value caption="FLT8" name="" value="0x7" />
         <value caption="FLT7" name="" value="0x6" />
         <value caption="FLT6" name="" value="0x5" />
         <value caption="FLT5" name="" value="0x4" />
         <value caption="FLT4" name="" value="0x3" />
         <value caption="FLT3" name="" value="0x2" />
         <value caption="FLT2" name="" value="0x1" />
         <value caption="FLT1" name="" value="0x0" />
      </value-group>
      <value-group caption="Current-Limit Mode Enable bit for PWM Generator x" name="IOCON1__CLMOD">
         <value caption="Current-limit function is enabled" name="" value="0x1" />
         <value caption="Current-limit function is disabled" name="" value="0x0" />
      </value-group>
