Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
      <value-group caption="Status Flag for Index Event Status bit" name="QEI1STAT__IDXIRQ">
         <value caption="Index event has occurred" name="" value="0x1" />
         <value caption="No Index event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEI1STAT__HOMIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEI1STAT__HOMIRQ">
         <value caption="Home event has occurred" name="" value="0x1" />
         <value caption="No Home event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEI1STAT__VELOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEI1STAT__VELOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEI1STAT__PCIIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit" name="QEI1STAT__PCIIRQ">
         <value caption="POSxCNT was reinitialized" name="" value="0x1" />
         <value caption="POSxCNT was not reinitialized" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEI1STAT__POSOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEI1STAT__POSOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEI1STAT__PCLEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI1STAT__PCLEQIRQ">
         <value caption="POSxCNT less than or equal to QEIxCMPL" name="" value="0x1" />
         <value caption="POSxCNT greater than QEIxCMPL" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Interrupt Enable bit" name="QEI1STAT__PCHEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Greater Than or Equal Compare Status bit" name="QEI1STAT__PCHEQIRQ">
         <value caption="POSxCNT greater than or equal to QEIxICCH" name="" value="0x1" />
         <value caption="POSxCNT less than QEIxICCH" name="" value="0x0" />
      </value-group>
      <value-group caption="Index Input Event Interrupt Enable bit" name="QEI2STAT__IDXIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Index Event Status bit" name="QEI2STAT__IDXIRQ">
         <value caption="Index event has occurred" name="" value="0x1" />
         <value caption="No Index event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Home Input Event Interrupt Enable bit" name="QEI2STAT__HOMIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Status Flag for Home Event Status bit" name="QEI2STAT__HOMIRQ">
         <value caption="Home event has occurred" name="" value="0x1" />
         <value caption="No Home event has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Interrupt Enable bit" name="QEI2STAT__VELOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Velocity Counter Overflow Status bit" name="QEI2STAT__VELOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has not occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Interrupt Enable bit" name="QEI2STAT__PCIIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Initialization Process Complete Status bit" name="QEI2STAT__PCIIRQ">
         <value caption="POSxCNT was reinitialized" name="" value="0x1" />
         <value caption="POSxCNT was not reinitialized" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Interrupt Enable bit" name="QEI2STAT__POSOVIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Overflow Status bit" name="QEI2STAT__POSOVIRQ">
         <value caption="Overflow has occurred" name="" value="0x1" />
         <value caption="No overflow has occurred" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Interrupt Enable bit" name="QEI2STAT__PCLEQIEN">
         <value caption="Interrupt is enabled" name="" value="0x1" />
         <value caption="Interrupt is disabled" name="" value="0x0" />
      </value-group>
      <value-group caption="Position Counter Less Than or Equal Compare Status bit" name="QEI2STAT__PCLEQIRQ">
         <value caption="POSxCNT less than or equal to QEIxCMPL" name="" value="0x1" />
         <value caption="POSxCNT greater than QEIxCMPL" name="" value="0x0" />
      </value-group>
