Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="" name="FLT2R" offset="0xf0" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="FLT2R" />
         </register>
         <register caption="" name="IC10R" offset="0xf4" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC10R" />
         </register>
         <register caption="" name="IC11R" offset="0xf8" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC11R" />
         </register>
         <register caption="" name="IC12R" offset="0xfc" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC12R" />
         </register>
         <register caption="" name="IC13R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC13R" />
         </register>
         <register caption="" name="IC14R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC14R" />
         </register>
         <register caption="" name="IC15R" offset="0x108" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC15R" />
         </register>
         <register caption="" name="IC16R" offset="0x10c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="IC16R" />
         </register>
         <register caption="" name="SCK5R" offset="0x110" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK5R" />
         </register>
         <register caption="" name="SDI5R" offset="0x114" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI5R" />
         </register>
         <register caption="" name="SS5R" offset="0x118" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS5R" />
         </register>
         <register caption="" name="SCK6R" offset="0x11c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SCK6R" />
         </register>
         <register caption="" name="SDI6R" offset="0x120" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SDI6R" />
         </register>
         <register caption="" name="SS6R" offset="0x124" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="SS6R" />
         </register>
         <register caption="" name="C3RXR" offset="0x128" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C3RXR" />
         </register>
         <register caption="" name="C4RXR" offset="0x12c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="C4RXR" />
         </register>
         <register caption="" name="QEA3R" offset="0x130" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA3R" />
         </register>
         <register caption="" name="QEB3R" offset="0x134" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB3R" />
         </register>
         <register caption="" name="INDX3R" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX3R" />
         </register>
         <register caption="" name="HOME3R" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME3R" />
         </register>
         <register caption="" name="QEA4R" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA4R" />
         </register>
         <register caption="" name="QEB4R" offset="0x144" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB4R" />
         </register>
         <register caption="" name="INDX4R" offset="0x148" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX4R" />
         </register>
         <register caption="" name="HOME4R" offset="0x14c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME4R" />
         </register>
         <register caption="" name="QEA5R" offset="0x150" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA5R" />
         </register>
         <register caption="" name="QEB5R" offset="0x154" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB5R" />
         </register>
         <register caption="" name="INDX5R" offset="0x158" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX5R" />
         </register>
         <register caption="" name="HOME5R" offset="0x15c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME5R" />
         </register>
         <register caption="" name="QEA6R" offset="0x160" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEA6R" />
         </register>
         <register caption="" name="QEB6R" offset="0x164" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="QEB6R" />
         </register>
         <register caption="" name="INDX6R" offset="0x168" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="INDX6R" />
         </register>
         <register caption="" name="HOME6R" offset="0x16c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="HOME6R" />
         </register>
         <register caption="" name="CLCIN1R" offset="0x170" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CLCIN1R" />
         </register>
         <register caption="" name="CLCIN2R" offset="0x174" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CLCIN2R" />
         </register>
         <register caption="" name="CLCIN3R" offset="0x178" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CLCIN3R" />
         </register>
         <register caption="" name="CLCIN4R" offset="0x17c" rw="RW" size="4">
            <bitfield mask="0x0000000F" name="CLCIN4R" />
         </register>
      </register-group>
   </module>
   <module caption="" id="02481" name="RPOR" version="">
      <register-group name="RPOR">
         <register caption="" name="RPA0R" offset="0x0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA0R" />
         </register>
         <register caption="" name="RPA1R" offset="0x4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA1R" />
         </register>
         <register caption="" name="RPA2R" offset="0x8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA2R" />
         </register>
         <register caption="" name="RPA3R" offset="0xc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA3R" />
         </register>
         <register caption="" name="RPA4R" offset="0x10" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA4R" />
         </register>
         <register caption="" name="RPA7R" offset="0x1c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA7R" />
         </register>
         <register caption="" name="RPA8R" offset="0x20" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA8R" />
         </register>
