Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32MK-MC_DFP/1.2.88/atdf/PIC32MK0512MCJ048.atdf
         <register caption="" name="RPA11R" offset="0x2c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA11R" />
         </register>
         <register caption="" name="RPA12R" offset="0x30" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA12R" />
         </register>
         <register caption="" name="RPA14R" offset="0x38" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA14R" />
         </register>
         <register caption="" name="RPA15R" offset="0x3c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPA15R" />
         </register>
         <register caption="" name="RPB0R" offset="0x40" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB0R" />
         </register>
         <register caption="" name="RPB1R" offset="0x44" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB1R" />
         </register>
         <register caption="" name="RPB2R" offset="0x48" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB2R" />
         </register>
         <register caption="" name="RPB3R" offset="0x4c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB3R" />
         </register>
         <register caption="" name="RPB4R" offset="0x50" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB4R" />
         </register>
         <register caption="" name="RPB5R" offset="0x54" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB5R" />
         </register>
         <register caption="" name="RPB6R" offset="0x58" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB6R" />
         </register>
         <register caption="" name="RPB7R" offset="0x5c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB7R" />
         </register>
         <register caption="" name="RPB9R" offset="0x64" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB9R" />
         </register>
         <register caption="" name="RPB10R" offset="0x68" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB10R" />
         </register>
         <register caption="" name="RPB11R" offset="0x6c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB11R" />
         </register>
         <register caption="" name="RPB12R" offset="0x70" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB12R" />
         </register>
         <register caption="" name="RPB13R" offset="0x74" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB13R" />
         </register>
         <register caption="" name="RPB14R" offset="0x78" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB14R" />
         </register>
         <register caption="" name="RPB15R" offset="0x7c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPB15R" />
         </register>
         <register caption="" name="RPC0R" offset="0x80" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC0R" />
         </register>
         <register caption="" name="RPC1R" offset="0x84" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC1R" />
         </register>
         <register caption="" name="RPC2R" offset="0x88" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC2R" />
         </register>
         <register caption="" name="RPC4R" offset="0x90" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC4R" />
         </register>
         <register caption="" name="RPC5R" offset="0x94" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC5R" />
         </register>
         <register caption="" name="RPC6R" offset="0x98" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC6R" />
         </register>
         <register caption="" name="RPC7R" offset="0x9c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC7R" />
         </register>
         <register caption="" name="RPC8R" offset="0xa0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC8R" />
         </register>
         <register caption="" name="RPC9R" offset="0xa4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC9R" />
         </register>
         <register caption="" name="RPC10R" offset="0xa8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC10R" />
         </register>
         <register caption="" name="RPC12R" offset="0xb0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC12R" />
         </register>
         <register caption="" name="RPC15R" offset="0xbc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPC15R" />
         </register>
         <register caption="" name="RPD3R" offset="0xcc" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD3R" />
         </register>
         <register caption="" name="RPD4R" offset="0xd0" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD4R" />
         </register>
         <register caption="" name="RPD5R" offset="0xd4" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD5R" />
         </register>
         <register caption="" name="RPD6R" offset="0xd8" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPD6R" />
         </register>
         <register caption="" name="RPE0R" offset="0x100" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE0R" />
         </register>
         <register caption="" name="RPE1R" offset="0x104" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE1R" />
         </register>
         <register caption="" name="RPE14R" offset="0x138" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE14R" />
         </register>
         <register caption="" name="RPE15R" offset="0x13c" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPE15R" />
         </register>
         <register caption="" name="RPF0R" offset="0x140" rw="RW" size="4">
            <bitfield mask="0x0000001F" name="RPF0R" />
         </register>
